name: "preprocess"
backend: "python"
max_batch_size: 32
input [
  {
    name: "AUDIO_RAW"
    data_type: TYPE_FP32
    dims: [ -1 ]  # batch x length
  }
]
output [
  {
    name: "input_values"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [0]
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8, 16 ]
  max_queue_delay_microseconds: 1000
}