name: "preprocess"
backend: "python"
input [
  {
    name: "AUDIO_RAW"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]
output [
  {
    name: "input_values"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]
  }
]