name: "wav2vec2"
platform: "onnxruntime_onnx"
input [
  {
    name: "input_values"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 1, 2 ]
  }
]