name: "ensemble_ser"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "AUDIO_RAW"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ -1, 2 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: 1
      input_map {
        key: "AUDIO_RAW"
        value: "AUDIO_RAW"
      }
      output_map {
        key: "input_values"
        value: "input_values"
      }
    },
    {
      model_name: "hubert"
      model_version: 1
      input_map {
        key: "input_values"
        value: "input_values"
      }
      output_map {
        key: "output"
        value: "output"
      }
    }
  ]
}
